//
//  Localizable.strings
//  Stats
//
//  Created by Serhiy Mytrovtsiy on 27/08/2020.
//  Using Swift 5.0.
//  Running on macOS 10.15.
//
//  Copyright © 2020 Serhiy Mytrovtsiy. All rights reserved.
//

// Modules
"CPU" = "Процесор";
"Open CPU settings" = "Відкрити налаштування процесору";
"GPU" = "Графічний процесор";
"Open GPU settings" = "Відкрити налаштування графічного процесора";
"RAM" = "Оперативна пам'ять";
"Open RAM settings" = "Відкрити налаштування оперативної пам'яті";
"Disk" = "Диск";
"Open Disk settings" = "Відкрити налаштування диска";
"Sensors" = "Датчики";
"Open Sensors settings" = "Відкрити налаштування датчиків";
"Network" = "Мережа";
"Open Network settings" = "Відкрити налаштування мережі";
"Battery" = "Акумулятор";
"Open Battery settings" = "Відкрити налаштування акумулятора";
"Bluetooth" = "Bluetooth";
"Open Bluetooth settings" = "Відкрити налаштування bluetooth";
"Clock" = "Годинник";
"Open Clock settings" = "Відкрити налаштування годинника";

// Words
"Unknown" = "Невідомо";
"Version" = "Версія";
"Processor" = "Процесор";
"Memory" = "Память";
"Graphics" = "Графіка";
"Close" = "Закрити";
"Download" = "Завантажити";
"Install" = "Встановити";
"Cancel" = "Скасувати";
"Unavailable" = "Недоступно";
"Yes" = "Так";
"No" = "Ні";
"Automatic" = "Автоматичний";
"Manual" = "Ручний";
"None" = "Ніяка";
"Dots" = "Пункти";
"Arrows" = "Стрілки";
"Characters" = "Літери";
"Short" = "Короткий";
"Long" = "Довгий";
"Statistics" = "Статистика";
"Max" = "Мін.";
"Min" = "Макс.";
"Reset" = "Скинути";
"Alignment" = "Вирівнювання";
"Left alignment" = "Ліворуч";
"Center alignment" = "По центру";
"Right alignment" = "Праворуч";
"Dashboard" = "Головний екран"; // translategemma:4b
"Enabled" = "Включено";
"Disabled" = "Виключено";
"Silent" = "Безшумно";
"Units" = "Одиниці";
"Fans" = "Вентилятори";
"Scaling" = "Масштабування";
"Linear" = "Лінійне";
"Square" = "Квадратне";
"Cube" = "Кубічне";
"Logarithmic" = "Логарифмічне";
"Fixed scale" = "Фіксована";
"Cores" = "Ядра";
"Settings" = "Налаштування";
"Name" = "Назва";
"Format" = "Формат";
"Turn off" = "Вимкнути";
"Normal" = "Нормальний";
"Warning" = "Попереджнння";
"Critical" = "Критичний";
"Usage" = "Використання";
"2 minutes" = "2 хвилини";
"3 minutes" = "3 хвилини";
"10 minutes" = "10 хвилин";
"Import" = "Імпорт";
"Export" = "Експорт";
"Separator" = "Роздільник";
"Read" = "Зчитування";
"Write" = "Запис";
"Frequency" = "Частота";
"Save" = "Зберегти";
"Run" = "Запустити";
"Stop" = "Зупинити";
"Uninstall" = "Видалити";
"1 sec" = "1 сек";
"2 sec" = "2 сек";
"3 sec" = "3 сек";
"5 sec" = "5 сек";
"10 sec" = "10 сек";
"15 sec" = "15 сек";
"30 sec" = "30 сек";
"60 sec" = "60 сек";

// Setup
"Stats Setup" = "Налаштування";
"Previous" = "Попередня";
"Previous page" = "Попередня сторінка";
"Next" = "Наступна";
"Next page" = "Наступна сторінка";
"Finish" = "Завершити";
"Finish setup" = "Завершити налаштування";
"Welcome to Stats" = "Вітаю в Stats";
"welcome_message" = "Дякуємо, що використовуєте Stats, безкоштовним моніторингом системи macOS з відкритим кодом.";
"Start the application automatically when starting your Mac" = "Запускати програму автоматично під час запуску Mac";
"Do not start the application automatically when starting your Mac" = "Не запускати програму автоматично під час запуску Mac";
"Do everything silently in the background (recommended)" = "Робити усе у фоновому режимі (рекомендовано)";
"Check for a new version on startup" = "Перевірти наявність нової версії під час запуску програми";
"Check for a new version every day (once a day)" = "Щодня перевіряти наявність нової версії (один раз на день)";
"Check for a new version every week (once a week)" = "Щотижня перевіряти наявність нової версії (раз на тиждень)";
"Check for a new version every month (once a month)" = "Перевіряти наявність нової версії щомісяця (раз на місяць)";
"Never check for updates (not recommended)" = "Ніколи не перевіряти наявність оновлень (не рекомендовано)";
"Anonymous telemetry for better development decisions" = "Анонімна телеметрія для кращих рішень щодо програми";
"Share anonymous telemetry data" = "Ділитись анонімними даними телеметрії";
"Do not share anonymous telemetry data" = "Не передавати анонімні дані телеметрії";
"The configuration is completed" = "Налаштування завершено";
"finish_setup_message" = "Все налаштовано! \n Stats — це інструмент з відкритим вихідним кодом, він безкоштовний і таким завжди буде. \n Якщо вам це подобається ви можете підтримати проект, це завжди цінується!";

// Alerts
"New version available" = "Доступна нова версія";
"Click to install the new version of Stats" = "Натисніть щоб встановити нову версію Stats";
"Successfully updated" = "Успішно оновленно";
"Stats was updated to v" = "Stats оновлено до v%0";
"Reset settings text" = "Усі налаштування програми буде скинуто, і програма буде перезапущена. Ви впевнені, що хочете це зробити?";
"Support text" = "Дякуємо за використання Stats!\n\n Підтримка і вдосконалення цього проекту з відкритим вихідним кодом вимагає часу і ресурсів. Ваша підтримка допомагає нам продовжувати надавати безкоштовну і надійну програму для всіх.\n\nЯкщо ви вважаєте Stats корисною, будь ласка, зробіть свій внесок. Кожна копійка допомагає!";

// Settings
"Open Activity Monitor" = "Відкрити Монітор активності";
"Report a bug" = "Повідомити про помилку";
"Support the application" = "Підтримати програму";
"Close application" = "Закрити програму";
"Open application settings" = "Відкрити налаштування";
"Open dashboard" = "Відкрити dashboard";
"No notifications available in this module" = "У цьому модулі немає повідомлень";
"Open Calendar" = "Відкрити календар";
"Toggle the module" = "Перемкніть модуль";

// Application settings
"Update application" = "Оновити програму";
"Check for updates" = "Перевіряти оновленя";
"At start" = "При включенні";
"Once per day" = "Раз на день";
"Once per week" = "Раз на тиждень";
"Once per month" = "Раз на місяць";
"Never" = "Ніколи";
"Check for update" = "Перевірити оновленя";
"Show icon in dock" = "Показувати іконку в dock";
"Start at login" = "Запускати при логуванні";
"Build number" = "Номер збірки";
"Import settings" = "Імпорт налаштувань";
"Export settings" = "Експорт налаштувань";
"Reset settings" = "Скидання налаштувань";
"Pause the Stats" = "Призупинити Stats";
"Resume the Stats" = "Відновити Stats";
"Combined modules" = "Комбіновані модулі";
"Combined details" = "Комбіновані деталі";
"Spacing" = "Інтервал";
"Share anonymous telemetry" = "Ділитись анонімною телеметрією";
"Choose file" = "Виберіть файл";
"Stress tests" = "Стрес-тести";

// Dashboard
"Serial number" = "Серійний номер";
"Model identifier" = "Ідентифікатор моделі";
"Production year" = "Рік випуску";
"Uptime" = "Час роботи";
"Number of cores" = "%0 ядер";
"Number of threads" = "%0 потоків";
"Number of e-cores" = "%0 енергоефективних ядер";
"Number of p-cores" = "%0 високопродуктивних ядер";
"Disks" = "Диски";
"Display" = "Монітор";

// Update
"The latest version of Stats installed" = "Встановлено останню версію";
"Downloading..." = "Завантаження...";
"Current version: " = "Поточна версія:  ";
"Latest version: " = "Остання версія:  ";

// Widgets
"Color" = "Колір";
"Label" = "Етикетка";
"Box" = "Коробка"; // translategemma:4b
"Frame" = "Рамка";
"Value" = "Значення";
"Colorize" = "Розфарбувати";
"Colorize value" = "Розфарбувати значення";
"Additional information" = "Додаткова інформація";
"Reverse values order" = "Змінити порядок сортування";
"Base" = "Основа";
"Display mode" = "Режим відображення";
"One row" = "Один ряд";
"Two rows" = "Два ряди";
"Mini widget" = "Міні";
"Line chart widget" = "Лінійна діаграма";
"Bar chart widget" = "Гістограма";
"Pie chart widget" = "Кругова діаграма";
"Network chart widget" = "Діаграма мережі";
"Speed widget" = "Швидкість";
"Battery widget" = "Акумулятор";
"Stack widget" = "Стек";
"Memory widget" = "Пам'ять";
"Static width" = "Статична ширина";
"Tachometer widget" = "Тахометр";
"State widget" = "Стан";
"Text widget" = "Текст";
"Battery details widget" = "Віджет даних про акумулятор";
"Show symbols" = "Показати символи";
"Label widget" = "Етикетка";
"Number of reads in the chart" = "Кількість зчитувань на діаграмі";
"Color of download" = "Колір завантаження";
"Color of upload" = "Колір висилання";
"Monospaced font" = "Моноширинний шрифт";
"Reverse order" = "Зворотній порядок";
"Chart history" = "Тривалість діаграми";
"Default color" = "За замовчуванням";
"Transparent when no activity" = "Прозорий коли немає активності";
"Constant color" = "Постійний";

// Module Kit
"Open module settings" = "Відкрити налаштування модуля";
"Select widget" = "Активувати %0 віджет";
"Open widget settings" = "Відкрити налаштування віджета";
"Update interval" = "Інтервал оновлень";
"Usage history" = "Історія використання";
"Details" = "Деталі";
"Top processes" = "Топ процесів";
"Pictogram" = "Піктограма";
"Module" = "Модуль";
"Widgets" = "Віджети";
"Popup" = "Спливаюче віконо";
"Notifications" = "Cповіщення";
"Merge widgets" = "Об’єднайти віджети";
"No available widgets to configure" = "Немає доступних віджетів для налаштування";
"No options to configure for the popup in this module" = "У цьому модулі немає параметрів для налаштування спливаючого вікна";
"Process" = "Процес";
"Kill process" = "Завершити процес";
"Keyboard shortcut" = "Комбінація клавіш";
"Listening..." = "Слухаю...";

// Modules
"Number of top processes" = "Кількість процесів";
"Update interval for top processes" = "Інтервал оновлення для процесів";
"Notification level" = "Рівень сповіщення";
"Chart color" = "Колір діаграми";
"Main chart scaling" = "Масштабування основної діаграми";
"Scale value" = "Значення масштабування";
"Text widget value" = "Значення текстового віджета";

// CPU
"CPU usage" = "Використання процесора";
"CPU temperature" = "Температура процесора";
"CPU frequency" = "Частота процесора";
"System" = "Система";
"User" = "Користувач";
"Idle" = "Вільно";
"Show usage per core" = "Показати використання на одне ядро";
"Show hyper-threading cores" = "Показати Hyper-Threading ядра";
"Split the value (System/User)" = "Розділити значення (Система/Користувач)";
"Scheduler limit" = "Обмеження планувальника";
"Speed limit" = "Обмеження швидкості";
"Average load" = "Середнє навантаження";
"1 minute" = "1 хвилина";
"5 minutes" = "5 хвилин";
"15 minutes" = "15 хвилин";
"CPU usage threshold" = "Поріг використання процесора";
"CPU usage is" = "Використання процесора %0";
"Efficiency cores" = "Енергоефективні ядра";
"Performance cores" = "Високопродуктивні ядра";
"System color" = "Системний колір";
"User color" = "Колір користувача";
"Idle color" = "Колір простою";
"Cluster grouping" = "Кластерне групування";
"Efficiency cores color" = "Колір енергоефективних ядер";
"Performance cores color" = "Колір високопродуктивних ядер";
"Total load" = "Загальне використання";
"System load" = "Використання системи";
"User load" = "Використання користувача";
"Efficiency cores load" = "Використання енергоефективних ядер";
"Performance cores load" = "Використання високопродуктивних ядер";
"All cores" = "Всі ядра";

// GPU
"GPU to show" = "Активний графічний процесор";
"Show GPU type" = "Показувати тип графічного процесора";
"GPU enabled" = "Увімкнено";
"GPU disabled" = "Вимкнено";
"GPU temperature" = "Температура графічного процесора";
"GPU utilization" = "Навантаженість графічного процесора";
"Vendor" = "Постачальник";
"Model" = "Модель";
"Status" = "Статус";
"Active" = "Активна";
"Non active" = "Неактивна";
"Fan speed" = "Швидкість вентилятора";
"Core clock" = "Частота процесора";
"Memory clock" = "Частота пам'яті";
"Utilization" = "Використання";
"Render utilization" = "Використання render";
"Tiler utilization" = "Використання tiler";
"GPU usage threshold" = "Поріг використання графічного процесора";
"GPU usage is" = "Використання графічного процесора %0";

// RAM
"Memory usage" = "Навантаженість пам’яті";
"Memory pressure" = "Рівень навантаження";
"Total" = "Загально";
"Used" = "Використовується";
"App" = "Програми";
"Wired" = "Постійна";
"Compressed" = "Стисненна";
"Free" = "Вільна";
"Swap" = "Swap";
"Split the value (App/Wired/Compressed)" = "Розділити значення (Програми/Постійна/Стисненна)";
"RAM utilization threshold" = "Поріг використання оперативної пам'яті";
"RAM utilization is" = "Використання оперативної пам'яті %0";
"App color" = "Колір програми";
"Wired color" = "Колір постійної пам’яті";
"Compressed color" = "Колір стисненої пам’яті";
"Free color" = "Колір вільної пам’яті";
"Free memory (less than)" = "Вільна пам'ять (менше ніж)";
"Swap size" = "Розмір swap";
"Free RAM is" = "Вільна оперативна пам'ять %0";

// Disk
"Show removable disks" = "Показати зйомні диски";
"Used disk memory" = "Використано %0 з %1";
"Free disk memory" = "Вільно %0 з %1";
"Disk to show" = "Активний диск";
"Open disk" = "Відкрити диск";
"Switch view" = "Переключити вигляд";
"Disk utilization threshold" = "Поріг використання диска";
"Disk utilization is" = "Використання диска %0";
"Read color" = "Колір зчитування";
"Write color" = "Колір запису";
"Disk usage" = "Використання диска";
"Total read" = "Всього прочитано";
"Total written" = "Всього записано";
"Write speed" = "Запис";
"Read speed" = "Зчитування";
"Drives" = "Диски";
"SMART data" = "SMART дані";

// Sensors
"Temperature unit" = "Одиниця виміру температури";
"Celsius" = "Цельсія";
"Fahrenheit" = "Фаренгейта";
"Save the fan speed" = "Зберегти швидкість вентилятора";
"Fan" = "Вентилятор";
"HID sensors" = "HID датчики";
"Synchronize fan's control" = "Синхронізація керування вентиляторами";
"Current" = "Струм";
"Energy" = "Енергія";
"Show unknown sensors" = "Показати невідомі датчики";
"Install fan helper" = "Встановити помічник для вентилятора";
"Uninstall fan helper" = "Видалити помічник для вентилятора";
"Fan value" = "Значення вентилятора";
"Turn off fan" = "Вимкнути вентилятор";
"You are going to turn off the fan. This is not recommended action that can damage your mac, are you sure you want to do that?" = "Ви збираєтеся вимкнути вентилятор. Це не рекомендована дія, яка може зламати ваш Mac. Ви впевнені, що хочете це зробити?";
"Sensor threshold" = "Поріг датчика";
"Left fan" = "Лівий";
"Right fan" = "Правий";
"Fastest fan" = "Найшвидший";
"Sensor to show" = "Активний датчик";

// Network
"Uploading" = "Висилання";
"Downloading" = "Завантаження";
"Public IP" = "Публічний IP";
"Local IP" = "Локальний IP";
"Interface" = "Інтерфейс";
"Physical address" = "Фізичний адрес";
"Refresh" = "Оновити";
"Click to copy public IP address" = "Натисніть, щоб скопіювати публічний IP";
"Click to copy local IP address" = "Натисніть, щоб скопіювати локальний IP";
"Click to copy wifi name" = "Натисніть, щоб скопіювати назву wifi";
"Click to copy mac address" = "Натисніть, щоб скопіювати фізичний адрес";
"No connection" = "Немає з'єднання";
"Network interface" = "Мережевий інтерфейс";
"Total download" = "Загально завантажено";
"Total upload" = "Загально вислано";
"Reader type" = "Метод читання";
"Interface based" = "Інтерфейс";
"Processes based" = "Процеси";
"Reset data usage" = "Скинути використання даних";
"VPN mode" = "Режим VPN";
"Standard" = "Стандарт";
"Security" = "Шифрування";
"Channel" = "Канал";
"Common scale" = "Загальна шкала";
"Autodetection" = "Автовизначення";
"Widget activation threshold" = "Поріг активації віджета";
"Internet connection" = "Підключення до інтернету";
"Active state color" = "Колір активного стану";
"Nonactive state color" = "Колір неактивного стану";
"Connectivity host (ICMP)" = "Хост підключення (ICMP)";
"Leave empty to disable the check" = "Залиште пустим, щоб вимкнути перевірку";
"Connectivity history" = "Історія підключення";
"Auto-refresh public IP address" = "Автоматичне оновлення IP-адреси";
"Every hour" = "Щогодини";
"Every 12 hours" = "Кожні 12 годин";
"Every 24 hours" = "Кожні 24 години";
"Network activity" = "Мережева активність";
"Last reset" = "Останнє скидання %0 тому";
"Latency" = "Затримка";
"Upload speed" = "Висилання";
"Download speed" = "Завантаження";
"Address" = "Адреса";
"WiFi network" = "Мережа WiFi";
"Local IP changed" = "Локальна IP-адреса була змінена";
"Public IP changed" = "Публічна IP-адреса була змінена";
"Previous IP" = "Попередня IP-адреса: %0";
"New IP" = "Нова IP-адреса: %0";
"Internet connection lost" = "З’єднання з інтернетом втрачено";
"Internet connection established" = "З’єднання з інтернетом відновлено";

// Battery
"Level" = "Рівень заряду";
"Source" = "Джерело";
"AC Power" = "Мережа";
"Battery Power" = "Акумулятор";
"Time" = "Час";
"Health" = "Стан акумулятора";
"Amperage" = "Сила струму";
"Voltage" = "Напруга";
"Cycles" = "Кількість циклів";
"Temperature" = "Температура";
"Power adapter" = "Блок живлення";
"Power" = "Потужність";
"Is charging" = "Заряджається";
"Time to discharge" = "Час до розрядки";
"Time to charge" = "Час до зарядки";
"Calculating" = "Обчислення";
"Fully charged" = "Повністю заряджена";
"Not connected" = "Не під'єднаний";
"Low level notification" = "Повідомлення про низький рівень заряду";
"High level notification" = "Повідомлення про високий рівень заряду";
"Low battery" = "Низький заряд акумулятора";
"High battery" = "Високий заряд акумулятора";
"Battery remaining" = "%0% залишилось";
"Battery remaining to full charge" = "%0% до повного заряду";
"Percentage" = "Проценти";
"Percentage and time" = "Проценти і час";
"Time and percentage" = "Час і проценти";
"Time format" = "Формат часу";
"Hide additional information when full" = "Приховати додаткову інформацію, якщо акумулятор заряджений";
"Last charge" = "Остання зарядка";
"Capacity" = "Ємність";
"current / maximum / designed" = "поточна / максимальна / запроектована";
"Low power mode" = "Режим низької потужності";
"Percentage inside the icon" = "Відсоток всередині віджету";
"Colorize battery" = "Розфарбувати акумулятор";
"Charging current" = "Струм зарядки";
"Charging Voltage" = "Напруга зарядки";
"Charger state inside the battery" = "Стан зарядки всередині акумулятора";

// Bluetooth
"Battery to show" = "Активна батарея";
"No Bluetooth devices are available" = "Немає пристроїв Bluetooth";

// Clock
"Time zone" = "Часовий пояс";
"Local" = "Місцевий";
"Calendar" = "Календар";
"Show week numbers" = "Показати номери тижнів";
"Local time" = "Місцевий час";
"Add new clock" = "Додати новий годинник";
"Delete selected clock" = "Видалити вибраний годинник";
"Help with datetime format" = "Довідка з форматом дати й часу";

// Colors
"Based on utilization" = "На основі використання";
"Based on pressure" = "На основі тиску";
"Based on cluster" = "На основі кластера";
"System accent" = "Колір системи";
"Monochrome accent" = "Монохромний акцент";
"Clear" = "Прозорий";
"White" = "Білий";
"Black" = "Чорний";
"Gray" = "Сірий";
"Second gray" = "Інший сірий";
"Dark gray" = "Темно-сірий";
"Light gray" = "Світло-сірий";
"Red" = "Червоний";
"Second red" = "Інший червоний";
"Green" = "Зелений";
"Second green" = "Червоний зелений";
"Blue" = "Блакитний";
"Second blue" = "Інший блакитний";
"Yellow" = "Жовтий";
"Second yellow" = "Інший жовтий";
"Orange" = "Помаранчевий";
"Second orange" = "Інший помаранчевий";
"Purple" = "Фіолетовий";
"Second purple" = "Інший фіолетовий";
"Brown" = "Коричневий";
"Second brown" = "Інший коричневий";
"Cyan" = "Циан";
"Magenta" = "Пурпуровий";
"Pink" = "Рожевий";
"Teal" = "Чиряковий";
"Indigo" = "Індіго";
